Autodesk.Revit.UI.UISaveAsOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.UISaveAsOptions.ShowOverwriteWarning
Identifies if UI should show an overwrite warning dialog.
True if the UI should show a warning dialog prompting the user to overwrite a file if it exists, False if it should not.
Default is false.
Since:
2016

Autodesk.Revit.UI.UISaveAsOptions.#ctor
Default constructor.
Since:
2016

Autodesk.Revit.UI.UISaveAsOptions
This class contains UI options available for saving a document to disk with a new filename.
Since:
2016